# MemberForcesServiceData Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MemberForcesServiceData Class
Members See Also
---
The data needed by member forces server to perform type definition.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class MemberForcesServiceData : IDisposable
```

Visual Basic
---
```text
Public Class MemberForcesServiceData _
	Implements IDisposable
```

Visual C++
---
```text
public ref class MemberForcesServiceData : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure..::..MemberForcesServiceData
# See Also
MemberForcesServiceData Members
Autodesk.Revit.DB.Structure Namespace